# Description:
#   イカレギュラーマッチのステージ情報を返す
#
# Notes:
#   イカ、よろしくー
#
kaiwa = {
  "Ｂバスパーク": [
    ["スケボーは苦手･･･\n骨折とかしそう･･･", "骨、無いじゃん･･･"],
    ["ここは 接近戦が勝負の決め手！\n死角も多い！", "高台から チャージャー使うのも\n捨てがたいよね～"],
    ["ホタルちゃん！\nここで気を付ける所は？", "･･････背後？"],
    ["バトル後に出てくるジャッジくん！\nヤシの実を取ろうとして、落ちてたよー！", "ダイエットしなきゃね～、おたがい"],
    ["ここでコンサートしたら\nチョー盛り上がりそー！", "アオリちゃん、\nたまに いい事言うよね"],
    ["あー、ヤシの実ー！\nジュース、飲みたいなー！", "ごいっしょに、ポテトもどうぞ～"],
    ["ここって 勢い余って、お客さんに\nインクがかかりそうになるよね", "･･･ワザとやってね？"],
    ["ここで遊んだあとのジュース\n美味しいよねー", "アオリちゃん、\nそれ前もどっかで言ってたよね･･･"],
    ["真ん中の高台、眺めイイよねー", "ボンヤリしてたら、うたれっぞ～"],
    ["昔って、こんな遊び場 なかったよね\n最近の若い子は恵まれすぎだよー", "アタシたちも じゅうぶん若いけどな"],
    ["ここ、カナアミがあるんだよね！\n知らなかったよ･･･", "とっくの昔からあったっしょ"]
  ],
  "Bバスパーク": [
    ["スケボーは苦手･･･\n骨折とかしそう･･･", "骨、無いじゃん･･･"],
    ["ここは 接近戦が勝負の決め手！\n死角も多い！", "高台から チャージャー使うのも\n捨てがたいよね～"],
    ["ホタルちゃん！\nここで気を付ける所は？", "･･････背後？"],
    ["バトル後に出てくるジャッジくん！\nヤシの実を取ろうとして、落ちてたよー！", "ダイエットしなきゃね～、おたがい"],
    ["ここでコンサートしたら\nチョー盛り上がりそー！", "アオリちゃん、\nたまに いい事言うよね"],
    ["あー、ヤシの実ー！\nジュース、飲みたいなー！", "ごいっしょに、ポテトもどうぞ～"],
    ["ここって 勢い余って、お客さんに\nインクがかかりそうになるよね", "･･･ワザとやってね？"],
    ["ここで遊んだあとのジュース\n美味しいよねー", "アオリちゃん、\nそれ前もどっかで言ってたよね･･･"],
    ["真ん中の高台、眺めイイよねー", "ボンヤリしてたら、うたれっぞ～"],
    ["昔って、こんな遊び場 なかったよね\n最近の若い子は恵まれすぎだよー", "アタシたちも じゅうぶん若いけどな"],
    ["ここ、カナアミがあるんだよね！\n知らなかったよ･･･", "とっくの昔からあったっしょ"]
  ],
  "デカライン高架下": [
    ["ドライブに連れてってくれる\nイケメン君！れんらく、ヨロシクー！", "公共の電波は 正しく使いましょ～"],
    ["いつ見ても デカい道だよねー！", "そこはバトル、関係無いっしょ"],
    ["ねぇねぇ ホタルちゃん、\nここの必勝法 教えてー！", "え～、言えるワケ無いじゃん"],
    ["ここの電光ボードのイラストは\nウチらへの ファンレターなんだよー！", "全部そうだったら いいけどな～"],
    ["ここは、中央広場を制することが\n勝利への近道！", "アタシなら、裏道から 攻めるかな～"],
    ["ここのスズメ、チョーカワイイ！\nいやされるゥ！", "アオリちゃん、トリ派なんだ"],
    ["バトルの最後に出て来るジャッジくんって\n昼間よく寝てるよねー", "夜型らしいから、\n夜なら 起きてるとこ見れるかもな～"],
    ["疲れたらいつも ここの自販機で\nジュース買って飲むんだよー！", "わざわざニュースで\nアピールする内容じゃないっしょ･･･"],
    ["あー、今カッコイイ車が見えたかも！\n運転したいなー", "こないだ仮免落ちてたっしょ･･･"],
    ["この近くの店のメガホイップチョコチップ\nダブルワッフル食べたいなー", "よく噛まんね･･･"],
    ["あー･･･、えーと、ここは･･････", "カンペまだ？"],
    ["そう言えば昔、\nここに取材に来たことあるよね？", "･･････そうだっけ？"]
  ],
  "シオノメ油田": [
    ["ここのエレベータ、乗るの楽しいよね！\nワクワク♪", "え？ こわくね？"],
    ["バトル後に出て来る ジャッジくんって、\nバトル中は どこで待ってるんだろ？", "魚 食べてるの、\n見かけた事あるけどな～"],
    ["ここは、高い所を制すと有利！\n･･･とも限らないのが ポイント！", "低い所ばっかでも ダメ～"],
    ["ここって 油田があるんだよね？\nボムとか投げたら 危なくない？", "インクだからダイジョブ、ダイジョブ"],
    ["ここ カモメ多いから、\nインクが 当たっちゃうんだよね…", "たまに おそわれるの、\nアンタのせいか･･･"],
    ["ここのバトルは、\nしお風が目にしみて 苦手だわー", "バトル後は シオカラ寸前だよね～"],
    ["ねえねえ、ホタルちゃんなら\nここは どう攻める？", "ガンガン攻める"],
    ["失恋したら冬の海\n見に来たりしちゃうのかな？", "カゼ引かんようにね～"],
    ["ホタルちゃん、なんかダジャレ考えてー", "えっ･･･無茶ぶりせんで"],
    ["この辺、何も無いから不便だわー\nコンビニできないかなー？", "海の上じゃ 採算取れんっしょ"],
    ["あ！ここ、社会の授業で習ったことあるよね！", "なんか有名らしいね～"],
    ["ヨットでプカプカ揺られて\nおひるねしたいなー", "アオリちゃん そのままどっかに\n流されちゃいそうだから やめてね･･･"]
  ],
  "ハコフグ倉庫": [
    ["荷物に乗って、\n高いとこから ショーーット！", "･･････ん？\n一番好きなのは　ローラーなんじゃん？"],
    ["ここ、いつもコンテナだらけだよね\n何が入ってんだろ？", "アタシたちのグッズだったらな～"],
    ["暗い工場の 片スミで\n若い２人が･･･", "バトルに 明け暮れま～す♪"],
    ["ここ、夢中でバトってると、\n荷物に インクかかっちゃうよね･･･", "消えるインクだから\nダイジョブ、ダイジョブ"],
    ["ここって いっつも\nダンボールが 流れてるよね～", "みんな、ポチり過ぎ～"],
    ["アタシたち、下積み時代\nここでバイトした事あるよねー！", "アオリちゃん、\nライン 止めまくりだったけどな･･･"],
    ["ハイ、ホタルちゃん！\nこのステージの 攻略ポイントは？！", "とにかく、がんばる～"],
    ["ここでバイトしてた時に着てた作業着、\n地味に可愛かったよね？", "あ～、ハコフグのアップリケのところだけな"],
    ["一緒にバイトしてたあの人たち、\n元気してるかなー", "ミスしても みんな優しかったよね～"],
    ["ホタルちゃん、\nこないだここで ボロ負けしてたよね？", "いやあれは･･････\n新しいブキを試してただけやし･･････"],
    ["バイトしてた時、\nここの食堂行くの楽しみだったなー", "ちょっと油ギッシュだったけど･･･"],
    ["続いては、読者からのお便りのコーナー！", "まだステージ紹介、しめてないっしょ！"]
  ],
  "アロワナモール": [
    ["ここでのバトルだけど、\nホタルちゃんなら どう攻める？", "マンタのように まい、\nメカジキのように さす！"],
    ["ここのフードコートのポテト、\nおいしいから 食べ過ぎちゃう！", "あの量 見るたびに、\nドン引きするわ･･･"],
    ["ここ、よく営業に 来るんだよねー！", "･･･アオリちゃん、ピンでやってる？"],
    ["だれも居ないモールで 走り回るの、\nチョー気持ちいいー！", "あ～･･･\nだから 太んないんだ～"],
    ["こないだここで アタシたちと過ごす\nファンのつどい、やったよね～！", "次回は未定で～す"],
    ["見てみて！\nかわいいフクが あるよ！", "バトル中は 見とれんなよ～"],
    ["オフの日、このモール行くと\nすぐ声かけられるわー、つらいわー", "別の人と まちがえられてたじゃん･･･"],
    ["このモールができたおかげで、\n街に人が増えてきたよねー", "街に人が増えてきたから、\nモールができたんじゃね？"],
    ["う･･･また、ここのプレミアムポテト\n食べたくなってきた", "ボーナス出たら、食い行こか？"],
    ["バトった後、\nここのカフェでお茶シバくの 最高！", "シバく？"],
    ["ここでのバトリュの･･･", "噛んどるし･･･"],
    ["バトル後は、メイク直すの大変だわー", "アオリちゃん、いっつもスッピンやん･･･"],
    ["帽子とマスクとサングラス着けて\nばれないようにしないとだわー", "アオリちゃん、それ怪しいよ･･･"]
  ],
  "ホッケふ頭": [
    ["ここは見通しがいいから、\nチャージャーが かつやくするかも？", "･･･と見せかけて、ローラーかもね"],
    ["ここ、バトルが無い時は\nオススメのデートスポットらしいよ", "え～？\nそれは無いわ～"],
    ["フトウかー！\nつぶつぶ、あまくて おいしいよねー！", "アオリちゃん･･･\nそれブドウじゃね･･･？"],
    ["そう言えば、最後に来るジャッジくんって、\nどうやって バトルの判定してんだろね？", "ヒゲがレーダーに なってんじゃね？"],
    ["ここって、角から飛び出したら\nすぐやられちゃうんだよねー", "カベにかくれて深呼吸\n戦場の鉄則ゥ～"],
    ["ここは コンテナを イカに利用できるかが、\n勝利へのカギ！", "お仕事中、ゴメンナサ～イ"],
    ["ホタルちゃん！\nここの攻略ポイント、よろしくー！", "･･･ネット見たほうが 早くね？"],
    ["ここの交差点でブラスターが爆発すると、\nきっついよねー", "カベに隠れて深呼吸してると、\nやられるからな～･･･"],
    ["ホタルちゃん、なんかダジャレ考えてー", "ん～、コンテナに頭ぶつけたんよ～\nコンッ･･･てな"],
    ["フォークリフト運転するの楽しそう！", "車の免許も持ってないじゃん･･･"],
    ["アタシ、ここのシオの香り好きだなー", "なんか懐かしい感じするかも"]
  ],
  "モズク農園": [
    ["ここっていつも ポカポカしてるよね！", "暑いのヤダ～"],
    ["ハイカラシティのハイテク農園！\nいやー、すごい時代になったもんだ！", "アオリちゃん、アンタ何才ね･･･？"],
    ["そう言えば、じーちゃんが子供の時\nトマトとか 無かったらしいよ！", "その時代に 生まれたかった･･･"],
    ["ホタルちゃん、\nここの攻略ポイントは？", "･･･････････････え？\nゴメン、何だっけ？"],
    ["ここって 温度が高いから、\nすごい勢いで 作物が育つんだって！", "ポテトは育ててないのかな～"],
    ["インクを作物にかけると\nめっちゃ育つらしい！ ネットで見た！", "･･･ソースはどこよ？"],
    ["ねぇねぇ、バトル後に来るジャッジくんって\nなんか 変わった生き物だよねー", "･･･本番中は 私語禁止じゃね？"],
    ["ここって 蒸し暑いから、\nバトル後は汗だくだよねー", "黒い涙流してる自分にビビったわ"],
    ["こないだフライドポテトが\n地面から生えてるの見たかもー", "どうせ夢見てたんでしょ･･･"],
    ["ねぇねぇ！\nここって、小豆も作られてるんだってー", "久しぶりにおじいちゃんのオハギ、\n食いたくなってきたな･･･"],
    ["こんなハイテク農園でも、\n虫は居るんだよね･･･", "ダンゴムシまでならギリセーフ"],
    ["モズク農園とかけて アタシと解く\nそのココロは？", "ちょっと暑苦しい"]
  ],
  "ネギトロ炭鉱": [
    ["ここ、昔は\n人がいっぱい 居たんだよね", "おじいちゃん世代の人らは\nここで よくバトルしてたらしいよ～"],
    ["昔、この近くに\n駅があったらしいよ", "へ～"],
    ["ここは夜 すごいまぶしい船が\n走ってるけど、何してんのかな？", "アレ見ると、\n付いて行きたくなるよね～"],
    ["ホタルちゃん、ここの攻略ポイント\n教えてー！", "え～と、ショットを正確に！\nとかじゃね？"],
    ["ここって、オバケ出るらしいよ！\n夜中に光るんだって！", "それ、フク屋の エチゼンくんじゃね？"],
    ["ここって、くずれそうで\nくずれないよね！", "だれかが 直してくれてんじゃね？"],
    ["鉄橋下のバトルが チョーアツい！", "アレのせいで、チャージャーが\n向こうまで届かんのよね･･･"],
    ["オバケ出たーー！\nと思ったら、ジャッジくんだったよ", "フンイキたっぷりだかんね、ココ･･･"],
    ["私たち ここでＰＶ撮ったことあるよね？", "あんときゃ、体 張ってたな～"],
    ["ネギトロ炭鉱とかけて\nナワバリバトルと解く、そのココロは？", "スミを確保するのが重要です"],
    ["あっ！船だ！海外旅行、行きたいなー", "ウチらも世界展開すれば、\n経費で行けるっしょ"]
  ],
  "タチウオパーキング": [
    ["ちょっとした足場も\n上手く使おー！", "アオリちゃんが\nまともな事 言ってる･･･"],
    ["ここ、ローラーで一気にかけ下りると\nチョー気持ちいいー！", "そこをチャージャーで\nパスッ！"],
    ["それにしても、ここ 高いよねー･･･", "がけっぷちでバトるのが\nアツいんじゃん？"],
    ["あ！ ここ、ローラーが\n大かつやくするとこだ！", "･･････え？\nチャージャーじゃね？"],
    ["アタシ、高過ぎるのは\n苦手なんだよね･･･", "意外だよね～"],
    ["バトルの後、ジャッジくんが来なかったら\n結果は･･･だれが判定してくれるんだろ？", "ウチらにそのノウハウは無いからな～"],
    ["ホタルちゃん、\nここの必勝法 教えてー！", "やられる前に やる～"],
    ["ジャッジくんって、\nこんな高いとこの判定もするんだよねー", "なんか高いとこ、好きみたいじゃん？"],
    ["あ、ヘリ！運転したーい", "仮免落ちる人のヘリとか\n乗りたくないわ～"],
    ["下 かすんでて見えないよね･･･", "この辺 空気悪いんじゃね？"],
    ["こっから見える高速って\nデカライン高架下の高速と一緒かなー？", "高速つながってたら あのコテコテの\nワッフル食べ行くつもりっしょ･･･"],
    ["ここの駐車場代って、高いんだってねー", "値段見た時、家賃かと思ったし･･･"]
  ],
  "モンガラキャンプ場": [
    ["しっかし、ここのトーテムポール、\nいつ見ても キモイ･･･", "え･･･\nアタシは カワイイと思うけど･･･"],
    ["ここは広いぞー！\n走れ走れー！", "アタシなら、あえて動かず\nチャージャーかな～"],
    ["ここの水には\n落ちないようにしなきゃね", "アタシたち、泳げんからね･･･"],
    ["ホタルちゃん、\nここの攻略ポイントよろしくー！", "･･････自分を 信じる！"],
    ["このキャンプ場って、できるまで\n何回も作り直したらしいよ！", "メーワクな設計者だな･･･"],
    ["オフの日、ここでキャンプしたーい！", "アタシ お家でゴロゴロしたい･･･"],
    ["アタシたち よくバトルしてるけど、\nジャッジくんって、昔から居るよね？", "てか、ウチらが生まれる前から\nおるらしいよ･･･"],
    ["キャンプ場かー！\nカレー食べたくなってきたー！", "レトルトなら、ウチにあるよ～"],
    ["昼間は太陽があったかくて、\n気持ちいいー！", "同じあったかいなら、床暖がいいわ･･･"],
    ["ここって 確かテーマソングあったよね？", "モンモンガララ モンガララ♪\n･･･言わせんといて"],
    ["ホタルちゃん、\nここのエピソード 何かない？", "えと･･････空気が美味しい？"],
    ["ホタルちゃん！ アタシ、はんごうで\nポテト作る方法 編み出したよ！", "着実にレパートリー増えとるね"]
  ],
  "ヒラメが丘団地": [
    ["ここ、高いところから見える夕日が\nキレイなんだよねー！", "さえぎるもん無いから、\n西日キッツいわ～"],
    ["昔みたいに\nここで鬼ごっこしたいなー！", "アオリちゃん、うるさくして\nすぐ怒られてたじゃん･･･"],
    ["ジャッジくんがここからハイカラシティに\n向かってるとこ見たよ！", "この辺に住んでんのかな？"],
    ["ここの団地って、\n建ってからだいぶ経つよねー", "住所はなんとかニュータウンやけどな･･･"],
    ["アタシ、10階くらいなら、\n階段でもヘッチャラだよー！", "エコやね～"],
    ["アタシ、団地に住むなら１階がいいな！", "学校へは一歩でも近い方がいいけんね"],
    ["ねぇねぇ、遠くに山が見えるよ！\nヤッホーーー！！", "ちょ･･････"],
    ["お布団とかにインクびしゃびしゃ\nかけちゃって 怒られないのかなー", "どうせ インクすぐ消えちゃうんだし\nダイジョブじゃん？"],
    ["昔 ここの高いところに住んでる友達居て\n窓から山が見えて うらやましかったなー", "アタシは、リビングに階段があるお家が\nうらやましかったな～"]
  ],
  "マサバ海峡大橋": [
    ["ここ開通したらスタジオ近くなるのになー\nそしたら もっと働ける！", "それ もっと寝てたいだけだよね･･･"],
    ["ここから遠くに見える島とかで\nノンビリおひるねとかしたいなー", "いつも じゅうぶん居眠りしてんじゃん･･･"],
    ["ハイ、ホタルちゃん！\nここの攻略ポイントを一言でよろしくー！", "アミの下からショットをうとう！\nとかじゃん？"],
    ["ここから見る港の夜景がキレイなんだー！", "こないだ夜 無理やり起こされて\n連れて行かれたっけ･･･"],
    ["この橋、チャリで走って渡ったら\n気持ちよさそー！", "アオリちゃん、\nチャリでよくこけてんじゃん･･･"],
    ["この橋、完成すると\nこの地方で１番長い橋になるんだって！", "通行料金も１番になりそうやね･･･"],
    ["この橋がつながると\n向こう岸に車で行けるようになるのかな？", "フェリーでのんびり行くのも\n捨てがたいけどね～"],
    ["見て見て！水平線が見えるよ！", "バトルに集中しような･･･"],
    ["ここ、ずっと工事中だよねー", "みんな サボってるんじゃね？"]
  ],
  "キンメダイ美術館": [
    ["バトルの終わり際に、味方全員にバリア\nおすそ分けするの、何て命名したっけ？", "エターナルファランクスΩな"],
    ["アタシ 絵見るの好きなんだー！", "見ながら寝てたじゃん･･･"],
    ["ここで おにごっこしたら楽しそうー！", "美術館では静かにしよ～"],
    ["ホタルちゃん！\nこの美術館の見どころは？", "併設のカフェが オシャレなとこ"],
    ["アタシ小さい頃、\n絵のコンクール受賞したんだよ！", "アオリちゃんの絵って、\nある意味アートっぽいもんね･･･"],
    ["芸術品にインクかけていいのかなー", "勝手に消えるし 大丈夫っしょ"],
    ["こないだここで シオカラ地方展\nやってたんだってー", "あ～、その日ちょうど フェスのライブで\n行けなかったしな～･･･"],
    ["ここ全部見て回るの１日かかるんだってー", "チラ見だと一瞬だけどな"],
    ["回るカベに乗るの、楽しいよねー", "酔うっしょ"]
  ],
  "マヒマヒリゾート＆スパ": [
    ["ホタルちゃん命名の、バトルの最後に\nトルネードするの 何って言うんだっけ？", "ファイナルクリスタルダストな"],
    ["ここでのバトルって、\n昼間は太陽が アツいよねー", "お客さんの視線も アツいけどな"],
    ["水に落ちた後のジャッジ君、\nズブぬれだと 誰かわかんなかったよ", "中に人は入ってなかったか"],
    ["ここって、なんで水位が変わるんだろー？", "電動っしょ"],
    ["昔、ここで水着ショーに出たことあるよね！", "ありゃ、黒歴史だわ･･･"],
    ["ここで 水着でバトルしたーい！", "よし ディレクターに相談だ！"],
    ["ホタルちゃん！ヒック\nここで ヒック、勝利ヒック、するには？", "とりま、しゃっくり止めんしゃい"],
    ["プールで遊んでる クラゲさんたち\n気持ちよさそうだよね～", "･･･ウチらも 試してみる？"],
    ["プールサイドで「ポテトラーメン」\nってのが売ってたよ！", "それ食ってからダイエットだ！"]
  ],
  "ショッツル鉱山": [
    ["なつかしー！ここもバイトやってたなー", "アオリちゃんの肉体労働って\n絵になるわ～"],
    ["あのデッカイ機械の名前知ってるー！\nなんとかベーター！！", "知ってないやん"],
    ["ここって、宝石とか取れるのかな？", "取れたら バトルとかしてないっしょ"],
    ["前ここに、キラキラ光る石があったよー？", "ジャッジ君の目じゃね？"],
    ["ナワバリバトルの時間切れ間際で\nボムラッシュするの、何て命名したっけ？", "ティアーズオブヘブン∞な"],
    ["ここって、スロッシャーで　バーン！って\nやればいいとこだ！", "雑やな･･･"],
    ["鉱山とかけて 勝利のヒケツと解く\nそのココロは？", "そこには カタい イシが有ります"],
    ["ここ、特撮のロケで よく使われるよねー", "爆破シーンで 砂煙りが映えるからな～"],
    ["ベルトコンベアに乗ると、\nなかなか前にすすめないよねー", "逆走しかしてなくね？"]
  ],
  "アンチョビットゲームズ": [
    ["あ、ミーティング！\nミーティング行かなきゃだわー", "ウチらにそんなの あったっけ？"],
    ["ここで働いてる人って賢そうだよねー！", "人によるっしょ"],
    ["ここの社員食堂って、\nタダで食べ放題なんだって！", "ま～たポテトの事、考えとったっしょ"],
    ["あ！発売前のゲームが動いてる！", "そのデスクの人、始末書だな･･･"],
    ["こんなオフィスで働きたいー！", "え･･･二足のわらじ？"],
    ["ここって 天窓のおかげで\n冬でも暖かそうだよね！", "ポテトを栽培するしか！"],
    ["なんで オフィスに\nプロペラが あんのかなー？", "かっこいいからっしょ"],
    ["机の上とか走って、ごめんなさーい", "･･･心の底から思ってる？"],
    ["関係者以外、立入禁止なのに\nジャッジ君って どこから来るんだろ？", "守衛所、ザルやね"]
  ]
};


sendNews = (robot) ->
  resp = "ハイカラニュースの時間だよ!\n"
  request_fes = robot.http("http://s3-ap-northeast-1.amazonaws.com/splatoon-data.nintendo.net/fes_info.json").get()
  request_fes (err, res, body_fes) ->
    json_fes = JSON.parse body_fes
    fes_state = json_fes["fes_state"]
    if fes_state >= 0
      state = ["告知", "開催"][fes_state]
      resp += "フェスが" + state + "されているよ!\n"
      resp += "お題は " + json_fes["team_alpha_name"] + " 対 " + json_fes["team_bravo_name"] + " だよ。\n"
    if fes_state == 1
      resp += "レギュラーは " + json_fes["fes_stages"][0]["name"] + " と " + json_fes["fes_stages"][1]["name"] + " と " + json_fes["fes_stages"][2]["name"] + " だよ。\n"
      resp += "イカ、よろしくー"
      robot.send {room: "#splatoon"}, resp
    else
      request_info = robot.http("https://splatoon.ink/schedule.json").get()
      request_info (err, res, body) ->
        json_info = JSON.parse body
        now_time = (new Date()).getTime()
        result = (item for item in json_info.schedule when item.startTime <= now_time and item.endTime >= now_time)[0]
        resp += "レギュラーは " + result.regular.maps[0]["nameJP"] + " と " + result.regular.maps[1]["nameJP"] + " だよ。\n"
        resp += "ガチマッチは " + result.ranked.maps[0]["nameJP"] + " と " + result.ranked.maps[1]["nameJP"] + " の " + result.ranked["rulesJP"] + " だよ。\n"
        resp += "イカ、よろしくー"
        robot.send {room: "#splatoon"}, resp

cron = require('cron').CronJob

data = {}
data.prologue = ":aori: ごきげんイカがですか？ハイカラニュースの時間だよ！\n:hotaru: こんちゃ〜、シオカラーズで〜す。\n"
data.regular = ":aori: 現在のレギュラーマッチのステージはコチラ！\n:hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n"
data.next = ":aori: 次の時間帯のレギュラーマッチのステージはコチラ！\n:hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n"
data.ranked = ":aori: 現在のガチマッチのステージはコチラ！\n:hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n"
data.epilogue = ":aori: じゃ、今日も元気にいってみよー！\n:aori: イカよろしくーーー！\n:hotaru: イカよろしく〜〜〜"
data.fes = ":aori: フェスマッチのステージはコチラ！\n:hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n"

news = {}

news.get = (name) ->
  if(!kaiwa[name])
    return "\n【" + name + "】\n:aori:\nまだ何も言うことないね！\n:hotaru:\nわたしらもよくわかってないもんね〜\n"
  s = kaiwa[name]
  k = s[Math.floor(Math.random() * s.length)]
  return "\n【" + name + "】\n:aori:\n" + k[0] + "\n:hotaru:\n" + k[1] + "\n"

news.processInfo = (robot, resp) ->
  request = robot.http("https://splatoon.ink/schedule.json").get()
  request (err, res, body) ->
    json_info = JSON.parse body
    now_time = (new Date()).getTime()
    result = (item for item in json_info.schedule when item.startTime <= now_time and item.endTime >= now_time)[0]
    resp += data.regular
    resp += news.get(result.regular.maps[0]["nameJP"]) + news.get(result.regular.maps[1]["nameJP"])
    resp += ":aori: 現在の" + result.ranked["rulesJP"] + "のステージはコチラ！\n:hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n"
    resp += news.get(result.ranked.maps[0]["nameJP"]) + news.get(result.ranked.maps[1]["nameJP"])
    resp += data.epilogue
    robot.send {room: "#splatoon"}, resp

news.processNextInfo = (robot, resp) ->
  request = robot.http("https://splatoon.ink/schedule.json").get()
  request (err, res, body) ->
    json_info = JSON.parse body
    now_time = (new Date()).getTime()
    result = (item for item in json_info.schedule when item.startTime > now_time and item.endTime >= now_time)[0]
    resp += data.next
    resp += news.get(result.regular.maps[0]["nameJP"]) + news.get(result.regular.maps[1]["nameJP"])
    resp += ":aori: 次の時間帯の" + result.ranked["rulesJP"] + "のステージはコチラ！\n:hotaru: じゃらじゃらじゃらじゃら〜...ばん！\n"
    resp += news.get(result.ranked.maps[0]["nameJP"]) + news.get(result.ranked.maps[1]["nameJP"])
    resp += data.epilogue
    robot.send {room: "#splatoon"}, resp

news.processFes = (robot) ->
  request = robot.http("http://s3-ap-northeast-1.amazonaws.com/splatoon-data.nintendo.net/fes_info.json").get()
  request (err, res, body_fes) ->
    json_fes = JSON.parse body_fes
    fes_state = json_fes["fes_state"]
    resp = data.prologue
    if fes_state >= 0 #告知
      resp += ":aori: カミ様が･････････動き出したようです！\n:hotaru: フェスか！\n"
      resp += ":aori: お題は " + json_fes["team_alpha_name"] + " 対 " + json_fes["team_bravo_name"] + " だよ！\n:hotaru: お～！ パチパチパチ～\n"
      resp += ":aori: ･･･てなワケで みなさん、ロビー前から 投票ヨロシクね！\n:hotaru: 投票したら フェスT借りれてるか、カスタマイズでチェックよろ～\n"
    if fes_state == 1
      resp += ":aori: " + json_fes["team_alpha_name"] + " vs " + json_fes["team_bravo_name"] + " のフェス、始まってるよー！\n:hotaru: ロビー前から投票して、参加しよ～\n"
      resp += data.fes
      resp += news.get(json_fes["fes_stages"][0]["name"]) + news.get(json_fes["fes_stages"][1]["name"]) + news.get(json_fes["fes_stages"][2]["name"])
      resp += data.epilogue
      robot.send {room: "#splatoon"}, resp
    else
      news.processInfo(robot, resp);

news.process = (robot) ->
  news.processFes(robot)


cronTimes = [
  "0 0 11 * * 1-5",
  "0 0 15 * * 1-5",
  "0 0 19 * * 1-5"
]

module.exports = (robot) ->
  for i in cronTimes
    do (i) ->
      new cron i, () =>
        news.process(robot)
      , null, true, "Asia/Tokyo"
  robot.respond /(ニュース|ステージ)/i, (msg) ->
    news.process(robot)


